<center> <img SRC="logo.png" align="center"/> </center>
<center><h1 style="color:#0C3C41"> Proyecto final Curso de Machine Learning <center></h1>
<center><h1 style="color:#0C3C41"> Caso de estudio:Banco Uno <center></h1>

<h3 style="color:#0C3C41"> Objetivo:Emprender un proyecto de ciencia de datos cuyo objetivo es diseñar e implementar una solución mediante el cual se facilite la toma de decisiones respecto a al proceso de otorgamiento de créditos. </h3>

<h3><i style="color:#09919F"> Pregunta realizada por el cliente:Se debe otorgar un credito o no?  </i></h3>
<h3><i style="color:#09919F"> Pregunta problema de estudio:Cual es la probabilidad de incumplimiento de pago de un cliente? </i></h3>

<h3> Variables de estudio </h3>
<p>
    
<b>X1(LIMIT_BAL):</b> Monto del credito otorgado.
    
<b>X2(SEX):</b> Género (1 = male; 2 = female).

<b>X3(EDUCATION):</b> Educación (1 = graduate school; 2 = university; 3 = high school; 0, = others).

<b>X4(MARRIAGE):</b> Estado civil (1 = married; 2 = single; 3 = divorced; 0 = others).

<b>X5(AGE):</b> Edad.
    
<b>X6-X11(Pay_0 a Pay_6):</b> Historial de pagos pasados (Abril a Septiembre).

<b>X12-X17 (BILL_AMT1 A BILL_AMT6):</b> Monto del extracto de la factura (dólar NT).

<b>X18-X23 (  PAY_AMT1 A   PAY_AMT6):</b> Monto del pago anterior (dólar NT). 
    
<b>Y(default payment next month):</b> (Y = 0 No predeterminado, Y = 1 Predeterminado).    
</p>

<h3 style="color: #8ED2D9"> 1.Importacion de librerias y carga de archivo </h3>

In [1]:
# Importacion de liberias
from sqlalchemy import create_engine #Conector a base de datos
import pymysql #Interfaz para base de datos
import pandas as pd # Manipulacion de dataframe
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
#Crear conexion para base de datos
db_connection_str = 'mysql+pymysql://deepanalytics:Sqltask1234!@34.73.222.197/deepanalytics'
db_connection = create_engine(db_connection_str)

In [3]:
#Sentencia SQL para extraer los datos del repositorio
df = pd.read_sql('SELECT * FROM credit', con=db_connection)

In [4]:
#Se guarda el archivo como csv
#Se importa sin el indice ni encabezados
df. to_csv ( 'BancoUno.csv', index = False, header=False )

In [5]:
#Se importa el archivo csv BancoUno
dic=r"C:\Users\aoban\OneDrive\Escritorio\Curso Analisis de datos\Proyecto Final Machine learning\BancoUno.csv"
dfbanco=pd.read_csv(dic)

<h3 style="color: #8ED2D9"> 2.Exploracion de dataset </h3>

In [6]:
dfbanco.head()

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
0,1,20000,female,university,1,24,2,2,-1,-1,...,0,0,0,0,689,0,0,0,0,default
1,2,120000,female,university,2,26,-1,2,0,0,...,3272,3455,3261,0,1000,1000,1000,0,2000,default
2,3,90000,female,university,2,34,0,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,not default
3,4,50000,female,university,1,37,0,0,0,0,...,28314,28959,29547,2000,2019,1200,1100,1069,1000,not default
4,5,50000,male,university,1,57,-1,0,-1,0,...,20940,19146,19131,2000,36681,10000,9000,689,679,not default

In [7]:
dfbanco.columns

Index(['ID', 'LIMIT_BAL', 'SEX', 'EDUCATION', 'MARRIAGE', 'AGE', 'PAY_0',
       'PAY_2', 'PAY_3', 'PAY_4', 'PAY_5', 'PAY_6', 'BILL_AMT1', 'BILL_AMT2',
       'BILL_AMT3', 'BILL_AMT4', 'BILL_AMT5', 'BILL_AMT6', 'PAY_AMT1',
       'PAY_AMT2', 'PAY_AMT3', 'PAY_AMT4', 'PAY_AMT5', 'PAY_AMT6',
       'default payment next month'],
      dtype='object')

In [8]:
dfbanco.shape

(30203, 25)

In [9]:
dfbanco.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30203 entries, 0 to 30202
Data columns (total 25 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   ID                          30202 non-null  object
 1   LIMIT_BAL                   30203 non-null  object
 2   SEX                         30203 non-null  object
 3   EDUCATION                   30203 non-null  object
 4   MARRIAGE                    30203 non-null  object
 5   AGE                         30203 non-null  object
 6   PAY_0                       30203 non-null  object
 7   PAY_2                       30203 non-null  object
 8   PAY_3                       30203 non-null  object
 9   PAY_4                       30203 non-null  object
 10  PAY_5                       30203 non-null  object
 11  PAY_6                       30203 non-null  object
 12  BILL_AMT1                   30203 non-null  object
 13  BILL_AMT2                   30203 non-null  object
 14  BILL_AMT3                   30203 non-null  object
 15  BILL_AMT4                   30203 non-null  object
 16  BILL_AMT5                   30203 non-null  object
 17  BILL_AMT6                   30203 non-null  object
 18  PAY_AMT1                    30203 non-null  object
 19  PAY_AMT2                    30203 non-null  object
 20  PAY_AMT3                    30203 non-null  object
 21  PAY_AMT4                    30203 non-null  object
 22  PAY_AMT5                    30203 non-null  object
 23  PAY_AMT6                    30203 non-null  object
 24  default payment next month  30203 non-null  object
dtypes: object(25)
memory usage: 5.8+ MB

In [10]:
dfbanco.describe()

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
count,30202,30203,30203,30203,30203,30203,30203,30203,30203,30203,...,30203,30203,30203,30203,30203,30203,30203,30203,30203,30203
unique,30001,83,4,6,6,58,13,13,13,13,...,21550,21012,20606,7945,7901,7520,6939,6899,6941,4
top,166,50000,female,university,2,29,0,0,0,0,...,0,0,0,0,0,0,0,0,0,not default
freq,2,3397,18217,14107,16088,1619,14828,15830,15863,16566,...,3218,3530,4045,5287,5437,6007,6450,6744,7233,23519

<h3 style="color: #8ED2D9"> 2.1.Revision de valores Nulos </h3>

In [11]:
valoresperdidos=dfbanco.isnull()
for column in valoresperdidos.columns.values.tolist():
    print(column)
    print(valoresperdidos[column].value_counts())
    print(" ")

ID
False    30202
True         1
Name: ID, dtype: int64

LIMIT_BAL
False    30203
Name: LIMIT_BAL, dtype: int64

SEX
False    30203
Name: SEX, dtype: int64

EDUCATION
False    30203
Name: EDUCATION, dtype: int64

MARRIAGE
False    30203
Name: MARRIAGE, dtype: int64

AGE
False    30203
Name: AGE, dtype: int64

PAY_0
False    30203
Name: PAY_0, dtype: int64

PAY_2
False    30203
Name: PAY_2, dtype: int64

PAY_3
False    30203
Name: PAY_3, dtype: int64

PAY_4
False    30203
Name: PAY_4, dtype: int64

PAY_5
False    30203
Name: PAY_5, dtype: int64

PAY_6
False    30203
Name: PAY_6, dtype: int64

BILL_AMT1
False    30203
Name: BILL_AMT1, dtype: int64

BILL_AMT2
False    30203
Name: BILL_AMT2, dtype: int64

BILL_AMT3
False    30203
Name: BILL_AMT3, dtype: int64

BILL_AMT4
False    30203
Name: BILL_AMT4, dtype: int64

BILL_AMT5
False    30203
Name: BILL_AMT5, dtype: int64

BILL_AMT6
False    30203
Name: BILL_AMT6, dtype: int64

PAY_AMT1
False    30203
Name: PAY_AMT1, dtype: int64

PAY_AMT2
False    30203
Name: PAY_AMT2, dtype: int64

PAY_AMT3
False    30203
Name: PAY_AMT3, dtype: int64

PAY_AMT4
False    30203
Name: PAY_AMT4, dtype: int64

PAY_AMT5
False    30203
Name: PAY_AMT5, dtype: int64

PAY_AMT6
False    30203
Name: PAY_AMT6, dtype: int64

default payment next month
False    30203
Name: default payment next month, dtype: int64

<h3 style="color: #8ED2D9">2.2. Revision de variables </h3>

In [66]:
dfbanco.dtypes

ID                              int32
LIMIT_BAL                     float64
SEX                            object
EDUCATION                      object
MARRIAGE                       object
AGE                             int32
PAY_0                         float64
PAY_2                         float64
PAY_3                         float64
PAY_4                         float64
PAY_5                         float64
PAY_6                         float64
BILL_AMT1                     float64
BILL_AMT2                     float64
BILL_AMT3                     float64
BILL_AMT4                     float64
BILL_AMT5                     float64
BILL_AMT6                     float64
PAY_AMT1                      float64
PAY_AMT2                      float64
PAY_AMT3                      float64
PAY_AMT4                      float64
PAY_AMT5                      float64
PAY_AMT6                      float64
default payment next month      int32
dtype: object

In [19]:
#Revision de variable ID
print(dfbanco["ID"].unique())

['1' '2' '3' ... '29998' '29999' '30000']

In [21]:
#Conversion de valor string a int
dfbanco["ID"]=dfbanco["ID"].astype("int")

In [12]:
#Revision de variable Limit_bal
print(dfbanco["LIMIT_BAL"].unique())

['20000' '120000' '90000' '50000' '500000' '100000' '140000' '200000'
 '260000' '630000' '70000' '250000' '320000' '360000' '180000' '130000'
 '450000' '60000' '230000' '160000' '280000' '10000' '40000' '210000'
 '150000' '380000' '310000' '400000' '80000' '290000' '340000' '300000'
 '30000' '240000' '470000' '480000' '350000' '330000' '110000' '420000'
 '170000' '370000' '270000' 'X1' 'LIMIT_BAL' '220000' '190000' '510000'
 '460000' '440000' '410000' '490000' '390000' '580000' '600000' '620000'
 '610000' '700000' '670000' '680000' '430000' '550000' '540000' '1000000'
 '530000' '710000' '560000' '520000' '750000' '640000' '16000' '570000'
 '590000' '660000' '720000' '327680' '740000' '800000' '760000' '690000'
 '650000' '780000' '730000']

In [13]:
#Busqueda de posicion valor string
dfbanco["LIMIT_BAL"].loc[dfbanco["LIMIT_BAL"]=="X2"]

Series([], Name: LIMIT_BAL, dtype: object)

In [14]:
#Busqueda de posicion valor string
dfbanco["LIMIT_BAL"].loc[dfbanco["LIMIT_BAL"]=="LIMIT_BAL"]

202    LIMIT_BAL
Name: LIMIT_BAL, dtype: object

In [15]:
#Se eliminan los valores string
dfbanco.drop([201,202],inplace=True)

In [16]:
#Conversion de valor string a int
dfbanco["LIMIT_BAL"]=dfbanco["LIMIT_BAL"].astype("int")

In [42]:
#Conversion de valor string a int
dfbanco["AGE"]=dfbanco["AGE"].astype("int")

In [40]:
#Conversion de las variables string a float
dfbanco[["PAY_0","PAY_2","PAY_3","PAY_4","PAY_5","PAY_6",
         "BILL_AMT1","BILL_AMT2","BILL_AMT3","BILL_AMT4","BILL_AMT5","BILL_AMT6",
         "PAY_AMT1","PAY_AMT2","PAY_AMT3","PAY_AMT4","PAY_AMT5","PAY_AMT6"]]=dfbanco[["PAY_0","PAY_2","PAY_3","PAY_4","PAY_5","PAY_6",
         "BILL_AMT1","BILL_AMT2","BILL_AMT3","BILL_AMT4","BILL_AMT5","BILL_AMT6",
         "PAY_AMT1","PAY_AMT2","PAY_AMT3","PAY_AMT4","PAY_AMT5","PAY_AMT6"]].astype("float")

In [50]:
#Revision de datos unicos para pagop predeterminado
dfbanco["default payment next month"].unique()

array(['default', 'not default'], dtype=object)

In [52]:
#Se pasa el valor string default a valor booleano 1
dfbanco["default payment next month"].replace("default",1,inplace=True)

In [53]:
#Se pasa el valor string not default a valor booleano 0
dfbanco["default payment next month"].replace("not default",0,inplace=True)

In [56]:
#Conversion de valores string a int
dfbanco["default payment next month"]=dfbanco["default payment next month"].astype("int")

In [67]:
#Revision de datos unicos para sexo
dfbanco["SEX"].unique()

array(['female', 'male'], dtype=object)

In [68]:
#Se pasa el valor string male a valor booelano 1
dfbanco["SEX"].replace("male",1,inplace=True)

In [70]:
#Se pasa el valor string female a valor booelano 0
dfbanco["SEX"].replace("female",0,inplace=True)

In [72]:
#Revision de datos unicos para education
dfbanco["EDUCATION"].unique()

array(['university', 'graduate school', 'high school', 'other'],
      dtype=object)

In [73]:
#Se pasa el valor string graduate school a valor booleano 1
dfbanco["EDUCATION"].replace("graduate school",1,inplace=True)

In [74]:
#Se pasa el valor string university a valor booelano 2
dfbanco["EDUCATION"].replace("university",2,inplace=True)

In [75]:
#Se pasa el valor string high school a valor booelano 3
dfbanco["EDUCATION"].replace("high school",3,inplace=True)

In [76]:
#Se pasa el valor string other a valor booelano 4
dfbanco["EDUCATION"].replace("other",4,inplace=True)

In [78]:
#Revision de datos unicos de Marriage
dfbanco["MARRIAGE"].unique()

array(['1', '2', '3', '0'], dtype=object)

In [80]:
dfbanco["MARRIAGE"]=dfbanco["MARRIAGE"].astype("int")

In [81]:
dfbanco.dtypes

ID                              int32
LIMIT_BAL                     float64
SEX                             int64
EDUCATION                       int64
MARRIAGE                        int32
AGE                             int32
PAY_0                         float64
PAY_2                         float64
PAY_3                         float64
PAY_4                         float64
PAY_5                         float64
PAY_6                         float64
BILL_AMT1                     float64
BILL_AMT2                     float64
BILL_AMT3                     float64
BILL_AMT4                     float64
BILL_AMT5                     float64
BILL_AMT6                     float64
PAY_AMT1                      float64
PAY_AMT2                      float64
PAY_AMT3                      float64
PAY_AMT4                      float64
PAY_AMT5                      float64
PAY_AMT6                      float64
default payment next month      int32
dtype: object